wouyanglv/bmi160/nRF5_SDK_17.0.0_9d13099/examples/ble_central/implantable MA central iis3dwb/main.c
            if (m_memory_access_in_progress)
            {
                m_memory_access_in_progress = false;
                scan_start();
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register handlers for BLE and SoC events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
    NRF_SDH_SOC_OBSERVER(m_soc_observer, APP_SOC_OBSERVER_PRIO, soc_evt_handler, NULL);
}



/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/** @brief Clear bonding information from persistent storage
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for disabling the use of whitelist for scanning.
 */
static void whitelist_disable(void)
{
    if (!m_whitelist_disabled)
    {
        NRF_LOG_INFO("Whitelist temporarily disabled.");
        m_whitelist_disabled = true;
        nrf_ble_scan_stop();
        scan_start();
    }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            whitelist_disable();
            break;

        default:
            break;
    }
}


char *uint64_to_string (uint64_t input)
{
     static char result [21] = "";
     memset(&result [0], 0, sizeof(result));
     char temp [21] = "";
     char c;
     uint8_t base=10;

     while (input)
     {
        int num=input % base;
        input /= base;
        c= '0' + num;

        sprintf(temp, "%c%s", c, result);
        strcpy(result, temp);
     }
     return result;
}


void biosignal_decode (uint8_t *p_encoded_buffer)
{
     uint64_t last_timestamp = (p_encoded_buffer [0] + p_encoded_buffer [1] * (((uint64_t) 1)<<8) +
                               p_encoded_buffer [2] * (((uint64_t) 1)<<16) + p_encoded_buffer [3] * (((uint64_t) 1)<<24) + 
                               p_encoded_buffer [4] * (((uint64_t) 1)<<32) + p_encoded_buffer [5] * (((uint64_t) 1)<<40) + 
                               p_encoded_buffer [6] * (((uint64_t) 1)<<48) + p_encoded_buffer [7] * (((uint64_t) 1)<<56))/1000; // in microsecs;
     uint32_t sample_period_us = (p_encoded_buffer [8] + p_encoded_buffer [9] * (1<<8) +  p_encoded_buffer [10] * (1<<16) +
                               p_encoded_buffer [11] * (1<<24))/1000;
     uint8_t sample_num = p_encoded_buffer [12];
//    SEGGER_RTT_printf(0,"stamp: %d\n", (uint32_t) last_timestamp/1000000);
//     SEGGER_RTT_printf(0,"period: %d\n", sample_period_us);
//     SEGGER_RTT_printf(0,"number: %d\n", sample_num);

     int16_t ecgSamples [sample_num];
    
     char buffer_packet [2048] = "";
     memset(&buffer_packet [0], 0, sizeof(buffer_packet));
     sprintf(buffer_packet, "(*%s*%d*%d", uint64_to_string (last_timestamp), sample_period_us, sample_num);     
     
     for (int i = 0; i < sample_num; i++)
     {
        // check if the signal is positive or negative. Negative numbers represented by two's complement.
        if ((p_encoded_buffer [i*2+14] & (1<<8)) == 0)
        {
          
          ecgSamples [i] = p_encoded_buffer [i*2+14] * (1<<8) +  p_encoded_buffer [i*2+13];
         // SEGGER_RTT_printf(0,"ecgSample [%d] : %d \r\n", i, ecgSamples[i]);

        }
        else
        {
          ecgSamples [i] = (1<<16) - (p_encoded_buffer [i*2+14] * (1<<8) + p_encoded_buffer [i*2+13]) + 1;
         // SEGGER_RTT_printf(0,"ecgSample [%d] : %d \r\n", i, ecgSamples[i]);
        }

       // ecgSamples[i] = (int16_t) ecgSamples[i];
        
       

        char buffer [1024];
        memset(&buffer [0], 0, sizeof(buffer));
        sprintf(buffer, "*%d", ecgSamples [i]);
           
        strcat(buffer_packet, buffer);
     }

    //SEGGER_RTT_printf(0,"%d\n", ecgSamples[54]);
     strcat(buffer_packet, "*)\n");

     int buffer_packet_len=strlen(buffer_packet);
     for (int k=0; k<buffer_packet_len; k++)
     {
        app_uart_put(buffer_packet[k]);
     }

